# -*- coding: utf-8 -*-
"""
Created on Fri May 24 16:24:28 2019

@author: TOA2SZH
"""

from BlinkRecognition import BlinkRecognition
        
        
if __name__=='__main__':
    br = BlinkRecognition()
    ##################################################
    #                                               ## 
    #   若已经存储好了特征  则直接运行他                  ##
    #                                               ##
    ##################################################
    #br.blink_recognition_run()
    ##################################################
    #                                               ## 
    #   若需要重新存储特征  则运行他                     ##
    #                                               ##
    ##################################################
    br.full_run()
    ##################################################
    #                                               ## 
    #   若只需要重新存储特征  则运行他 同时运行存储csv      ##
    #                                               ##
    ##################################################
#    br.face_recognition_main()
#    br.save_2_csv_main()